# Индивидуальное задание
Опираясь на полученные ранее знания реализуйте приложение согласно своему варианту по журналу:

1. **Калькулятор логических выражений**:
   - Создайте консольное приложение, которое принимает логическое выражение (например, `true && false || !true`) и вычисляет его значение. Используйте булевые выражения, тернарный оператор и switch case для обработки различных операторов. Методы: `bool.Parse`, `string.Split`.

2. **Анализатор текста**:
   - Напишите программу, которая принимает строку текста и анализирует её, выводя количество слов, количество символов, количество гласных и согласных. Используйте методы .NET для строк (`string.Split`, `char.IsLetter`, `char.IsVowel`), циклы for и while для анализа текста.

3. **Игра "Угадай число"**:
   - Создайте игру, в которой компьютер загадывает число от 1 до 100, а пользователь пытается его угадать. Используйте циклы do while и while для организации игрового процесса, тернарный оператор для подсказок (больше/меньше) и switch case для обработки команд пользователя (например, "сдаться"). Методы: `Random.Next`, `int.Parse`.

4. **Сортировка массива**:
   - Напишите программу, которая принимает массив целых чисел и сортирует его различными методами (пузырьковая сортировка, сортировка вставками и т.д.). Используйте циклы for и методы .NET для работы с массивами (`Array.Sort`, `Array.Reverse`).

5. **Калькулятор выражений**:
   - Создайте консольное приложение, которое принимает математическое выражение (например, `3 + 5 * 2 - 8 / 4`) и вычисляет его значение. Используйте switch case для обработки операторов, циклы для парсинга выражения и методы .NET для строк (`string.Split`, `int.Parse`).

6. **Генератор паролей**:
   - Напишите программу, которая генерирует случайные пароли заданной длины, используя буквы, цифры и специальные символы. Используйте методы .NET для строк и массивов (`Random.Next`, `char.IsLetterOrDigit`), тернарный оператор для выбора символов и циклы for для генерации пароля.

7. **Анализатор логов**:
   - Создайте приложение, которое анализирует файл логов и выводит статистику по различным событиям (например, количество ошибок, предупреждений и информационных сообщений). Используйте методы .NET для работы с файлами и строками (`File.ReadAllLines`, `string.Contains`), циклы for и while для анализа логов.

8. **Калькулятор дат**:
   - Напишите программу, которая принимает две даты и вычисляет разницу между ними в днях, месяцах и годах. Используйте методы .NET для работы с датами (`DateTime.Parse`, `DateTime.Subtract`), тернарный оператор для обработки различных случаев и циклы для вычислений.

9. **Игра "Крестики-нолики"**:
   - Создайте консольную игру "Крестики-нолики" для двух игроков. Используйте массивы для хранения игрового поля, циклы for для отрисовки поля и проверки победителя, switch case для обработки ходов игроков. Методы: `Array.Clear`, `Console.WriteLine`.

10. **Анализатор чисел**:
    - Напишите программу, которая принимает массив чисел и выводит статистику по ним (среднее значение, медиана, мода, стандартное отклонение). Используйте методы .NET для работы с массивами и строками (`Array.Sort`, `Enumerable.Average`, `Enumerable.Mode`), циклы for и while для вычислений, тернарный оператор для обработки различных случаев.